---
kind: enumMember
id: F:Autodesk.Revit.DB.DirectShapeRoomBoundingOption.NotApplicable
enum: Autodesk.Revit.DB.DirectShapeRoomBoundingOption
source: html/b102fe53-d044-819e-3639-bb0521cb232a.htm
---
# Autodesk.Revit.DB.DirectShapeRoomBoundingOption.NotApplicable

The associated DirectShape doesn't have a room bounding parameter, and isn't allowed to.
 Trying to change to this value will result in an exception.
 Trying to change from this value is restricted to DirectShapes that can be room bounding.